node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 256
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "global_step/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "mul"
  input: "mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/learning_rate"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00999999977648
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast"
  op: "Cast"
  input: "mul_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_1/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 4000000.0
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_2/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.949999988079
      }
    }
  }
}
node {
  name: "ExponentialDecay/truediv"
  op: "RealDiv"
  input: "ExponentialDecay/Cast"
  input: "ExponentialDecay/Cast_1/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Floor"
  op: "Floor"
  input: "ExponentialDecay/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Pow"
  op: "Pow"
  input: "ExponentialDecay/Cast_2/x"
  input: "ExponentialDecay/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay"
  op: "Mul"
  input: "ExponentialDecay/learning_rate"
  input: "ExponentialDecay/Pow"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "learning_rate/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "learning_rate"
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "ScalarSummary"
  input: "learning_rate/tags"
  input: "ExponentialDecay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3844
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 3844
          }
        }
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train00.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train01.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train02.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train03.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train04.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train05.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train06.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train07.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train08.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train09.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train0z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train10.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train11.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train12.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train13.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train14.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train15.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train16.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train17.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train18.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train19.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train1z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train20.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train21.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train22.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train23.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train24.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train25.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train26.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train27.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train28.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train29.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train2z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train30.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train31.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train32.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train33.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train34.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train35.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train36.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train37.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train38.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train39.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train3z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train40.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train41.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train42.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train43.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train44.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train45.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train46.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train47.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train48.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train49.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train4z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train50.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train51.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train52.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train53.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train54.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train55.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train56.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train57.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train58.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train59.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train5z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train60.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train61.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train62.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train63.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train64.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train65.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train66.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train67.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train68.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train69.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train6z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train70.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train71.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train72.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train73.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train74.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train75.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train76.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train77.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train78.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train79.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7i.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7j.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7k.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7l.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7m.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7n.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7o.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7p.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7r.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7s.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7t.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7u.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7v.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7w.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7x.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train7z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train80.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train81.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train82.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train83.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train84.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train85.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train86.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train87.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train88.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train89.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8A.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8B.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8C.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8D.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8E.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8F.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8G.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8H.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8I.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8J.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8K.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8L.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8M.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8N.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8O.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8P.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8Q.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8R.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8S.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8T.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8U.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8V.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8W.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8X.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8Y.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8Z.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8a.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8b.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8c.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8d.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8e.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8f.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8g.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8h.tfrecord"
        string_val: "gs://youtube8m-ml-us-east1/2/video/train/train8i.tfrecord"
